{"format":"csv","ignoreLeadingWhiteSpaceReading":null,"multiLine":null,"path":"dbfs:/FileStore/bobwelshmer/mortgage/MortgageEast.csv","ignoreTrailingWhiteSpaceReading":null,"maxColumns":null,"writeMode":"error","description":"","separator":",","compression":null,"nullValue":null,"nanValue":null,"escapeQuotes":null,"charToEscapeQuoteEscaping":null,"encoding":null,"inferSchema":null,"enforceSchema":null,"quoteAll":null,"ignoreLeadingWhiteSpaceWriting":null,"locale":null,"quote":null,"timestampFormat":null,"emptyValue":null,"recursiveFileLookup":null,"partitionColumns":null,"schema":{"type":"struct","fields":[{"name":"PropID","type":"string","nullable":true,"metadata":{"description":"Unique identifier for each property in the dataset. It stores alphanumeric values in string data type, providing a way to uniquely identify each property in the dataset.","mappings":[],"tags":[]}},{"name":"City","type":"string","nullable":true,"metadata":{"description":"The name of the city where the property is located. This column stores values of string data type and provides information about the geographical location of the property.","mappings":[],"tags":[]}},{"name":"State","type":"string","nullable":true,"metadata":{"description":"The state in which the property is located. It stores the two-letter abbreviation of the state name and is of string data type. This column provides information about the geographic location of the property.","mappings":[],"tags":[]}},{"name":"PropertyType","type":"string","nullable":true,"metadata":{"description":"Specifies the type of property associated with each mortgage. It stores values of string data type, indicating whether the property is a single-family home, multi-family home, condominium, or other type of property. This column provides important information about the characteristics of the properties associated with each mortgage.","mappings":[],"tags":[]}},{"name":"Servicer","type":"string","nullable":true,"metadata":{"description":"The name of the company or organization that services the mortgage loan. This column stores string values and provides information about the entity responsible for managing the loan payments and other related activities.","mappings":[],"tags":[]}},{"name":"ServicerType","type":"string","nullable":true,"metadata":{"description":"Indicates the type of servicer responsible for managing the mortgage loan. The values in this column are of string data type and provide information about the organization or entity responsible for servicing the loan, such as a bank or mortgage company. This column can be used to track the performance of different types of servicers and their impact on loan status and other metrics.","mappings":[],"tags":[]}},{"name":"LoanType","type":"string","nullable":true,"metadata":{"description":"Specifies the type of loan associated with each property. It stores values of string data type, indicating the type of loan taken by the property owner. This column provides information about the terms and conditions of the loan, such as interest rates and payment schedules.","mappings":[],"tags":[]}},{"name":"UnPaidBalance","type":"double","nullable":true,"metadata":{"description":"The outstanding balance on the mortgage loan for a particular property. This column stores numerical values in double data type, indicating the amount of money that the borrower still owes on their mortgage loan. It is an important metric for lenders to assess the risk associated with a particular loan.","mappings":[],"tags":[]}},{"name":"CurrentPropValue","type":"double","nullable":true,"metadata":{"description":"The current market value of the property associated with the mortgage. This column stores numerical values in double data type, indicating the estimated worth of the property at the time of data collection. It provides an insight into the value of the property and its potential for generating revenue.","mappings":[],"tags":[]}},{"name":"LoanStatus","type":"string","nullable":true,"metadata":{"description":"Indicates the current status of the loan associated with the property. The values in this column are of string data type and provide information on whether the loan is in good standing, delinquent, or in default. This column is important for tracking the overall health of the mortgage portfolio.","mappings":[],"tags":[]}}]},"escape":null,"unescapedQuoteHandling":null,"positiveInf":null,"comment":null,"lineSep":null,"componentInfo":{"gemId":"gitUri=http://gitserver:3000/DxEheDCJ_team_5751/DxEheDCJ_project_12654.git&subPath=&tag=0.2.4&projectSubscriptionProjectId=12654&path=gems/csv","projectName":"ProphecySparkBasicsPython"},"samplingRatio":null,"dateFormat":null,"mode":null,"header":true,"columnNameOfCorruptRecord":null,"modifiedBefore":null,"ignoreTrailingWhiteSpaceWriting":null,"maxCharsPerColumn":null,"negativeInf":null,"createSingleOutputFile":null,"pathGlobFilter":null,"datasetType":"File","useSchema":true,"modifiedAfter":null}