{"format":"csv","ignoreLeadingWhiteSpaceReading":null,"multiLine":null,"path":"dbfs:/FileStore/bobwelshmer/mortgage/MortgageWest.csv","ignoreTrailingWhiteSpaceReading":null,"maxColumns":null,"writeMode":"error","description":"","separator":",","compression":null,"nullValue":null,"nanValue":null,"escapeQuotes":null,"charToEscapeQuoteEscaping":null,"encoding":null,"inferSchema":null,"enforceSchema":null,"quoteAll":null,"ignoreLeadingWhiteSpaceWriting":null,"locale":null,"quote":null,"timestampFormat":null,"emptyValue":null,"recursiveFileLookup":null,"partitionColumns":null,"schema":{"type":"struct","fields":[{"name":"Account","type":"string","nullable":true,"metadata":{"description":"Unique identifier for each mortgage account. It stores values of string data type and provides a way to uniquely identify each mortgage account in the dataset.","mappings":[],"tags":[]}},{"name":"City","type":"string","nullable":true,"metadata":{"description":"The name of the city where the property associated with the mortgage is located. This column stores values of string data type and provides information about the geographical location of the property.","mappings":[],"tags":[]}},{"name":"State","type":"string","nullable":true,"metadata":{"description":"The state in which the property associated with the mortgage is located. This column stores values of string data type and provides information about the geographical location of the property.","mappings":[],"tags":[]}},{"name":"Property Type","type":"string","nullable":true,"metadata":{"description":"Indicates the type of property associated with each mortgage account. It stores values of string data type, providing information about the nature of the property, such as whether it is a single-family home, a condominium, or a commercial property.","mappings":[],"tags":[]}},{"name":"Servicer","type":"string","nullable":true,"metadata":{"description":"The name of the company or organization responsible for servicing the mortgage loan. This column stores string values and provides information about the entity responsible for collecting payments, managing the loan, and handling any issues related to the mortgage.","mappings":[],"tags":[]}},{"name":"Servicer Type","type":"string","nullable":true,"metadata":{"description":"This column represents the type of servicer responsible for managing the mortgage loan. It stores categorical values in string data type, indicating the type of organization that services the loan, such as a bank or a mortgage company. This information can be useful in understanding the management and servicing of the mortgage loan.","mappings":[],"tags":[]}},{"name":"Loan Type","type":"string","nullable":true,"metadata":{"description":"Indicates the type of loan taken by the borrower. It stores categorical values in string data type, providing information about the terms and conditions of the loan, such as fixed or adjustable interest rates, loan duration, and payment schedule.","mappings":[],"tags":[]}},{"name":"UnPaid Balance","type":"double","nullable":true,"metadata":{"description":"The outstanding balance on a mortgage loan. This column stores the monetary value of the remaining balance on a mortgage loan that has not yet been paid off. The values in this column are of string data type and represent the amount of money owed by the borrower to the lender.","mappings":[],"tags":[]}},{"name":"0","type":"integer","nullable":true,"metadata":{"description":"This column represents the number of days that a mortgage payment is overdue by 0 days. It stores numerical values in string data type, indicating the number of mortgages that are current and up to date with their payments.","mappings":[],"tags":[]}},{"name":"30","type":"integer","nullable":true,"metadata":{"description":"Represents the number of days past due for a mortgage payment. It stores numerical values in string data type, indicating the number of days that a payment is overdue. A value of '30' in this column indicates that the payment is 30 days past due.","mappings":[],"tags":[]}},{"name":"60","type":"integer","nullable":true,"metadata":{"description":"Represents the number of days a mortgage payment is overdue by 60 days or more. It stores numerical values in string data type, indicating the number of days a customer has missed their mortgage payment by 60 days or more. This column provides insight into the financial health of the mortgage portfolio and the likelihood of default by customers.","mappings":[],"tags":[]}},{"name":"90","type":"integer","nullable":true,"metadata":{"description":"This column represents the number of days that a mortgage payment is overdue by 90 days or more. It stores numerical values in string data type, indicating the number of days that a borrower has failed to make a payment. This column is important for assessing the risk of default on a mortgage loan.","mappings":[],"tags":[]}},{"name":"REO","type":"integer","nullable":true,"metadata":{"description":"REO stands for Real Estate Owned and refers to properties that have been foreclosed and are now owned by the mortgage lender. This column stores a binary value indicating whether a property is an REO or not. A value of 1 indicates that the property is an REO, while a value of 0 indicates that it is not.","mappings":[],"tags":[]}},{"name":"Current Prop Value","type":"double","nullable":true,"metadata":{"description":"This column represents the current market value of the property associated with each mortgage account. It stores numerical values in string data type, indicating the estimated worth of the property at the time of data collection. This value is subject to change over time due to fluctuations in the real estate market.","mappings":[],"tags":[]}},{"name":"LTV","type":"string","nullable":true,"metadata":{"description":"LTV stands for Loan-to-Value ratio and represents the ratio of the loan amount to the appraised value of the property. It is expressed as a percentage and is used to determine the risk associated with a mortgage loan. This column stores numerical values in string data type, indicating the LTV ratio for each mortgage loan.","mappings":[],"tags":[]}},{"name":"Avg OEP","type":"string","nullable":true,"metadata":{"description":"This column represents the average occupancy expense per unit. It stores numerical values and provides insight into the average cost of maintaining and operating each unit in the property. The values in this column are of string data type.","mappings":[],"tags":[]}},{"name":"Unemployment","type":"string","nullable":true,"metadata":{"description":"Represents the unemployment rate in the area where the property is located. It stores numerical values in string data type, indicating the percentage of unemployed individuals in the region. This column provides insight into the economic conditions of the area and can be used to analyze the impact of unemployment on mortgage defaults and foreclosures.","mappings":[],"tags":[]}},{"name":"Avg Values","type":"string","nullable":true,"metadata":{"description":"This column represents the average value of properties in the area where the mortgage is held. It stores numerical values in string data type, indicating the average property value in the region. This information can be useful in determining the overall value of the mortgage portfolio and assessing the risk associated with it.","mappings":[],"tags":[]}},{"name":"Inventory","type":"string","nullable":true,"metadata":{"description":"Inventory refers to the number of properties that are currently owned by the mortgage company. It stores numerical values and provides an insight into the company's current holdings. The values in this column are of string data type.","mappings":[],"tags":[]}},{"name":"Days on Market","type":"string","nullable":true,"metadata":{"description":"The number of days a property has been listed on the market. This column stores numerical values and provides insight into the length of time it takes for a property to sell. It is an important metric for real estate professionals and investors to track market trends and property values.","mappings":[],"tags":[]}}]},"escape":null,"unescapedQuoteHandling":null,"positiveInf":null,"comment":null,"lineSep":null,"componentInfo":{"gemId":"gitUri=http://gitserver:3000/DxEheDCJ_team_5751/DxEheDCJ_project_12654.git&subPath=&tag=0.2.30&projectSubscriptionProjectId=12654&path=gems/csv","projectName":"ProphecySparkBasicsPython"},"samplingRatio":null,"dateFormat":null,"mode":null,"header":true,"columnNameOfCorruptRecord":null,"modifiedBefore":null,"ignoreTrailingWhiteSpaceWriting":null,"maxCharsPerColumn":null,"negativeInf":null,"createSingleOutputFile":null,"pathGlobFilter":null,"datasetType":"File","useSchema":true,"modifiedAfter":null}