{"format":"csv","ignoreLeadingWhiteSpaceReading":null,"multiLine":null,"path":"dbfs:/FileStore/bobwelshmer/mortgage/mtg_assist_program.csv","ignoreTrailingWhiteSpaceReading":null,"maxColumns":null,"writeMode":"overwrite","description":"","separator":",","compression":null,"nullValue":null,"nanValue":null,"escapeQuotes":null,"charToEscapeQuoteEscaping":null,"encoding":null,"inferSchema":null,"enforceSchema":null,"quoteAll":null,"ignoreLeadingWhiteSpaceWriting":null,"locale":null,"quote":null,"timestampFormat":null,"emptyValue":null,"recursiveFileLookup":null,"partitionColumns":null,"schema":{"type":"struct","fields":[{"name":"PropID","type":"string","nullable":true,"metadata":{"description":"Unique identifier for each property in the dataset. It stores alphanumeric values in string data type, providing a way to uniquely identify each property in the dataset.","mappings":[],"tags":[]}},{"name":"First_Name","type":"string","nullable":true,"metadata":{"description":"The first name of each customer is stored in this column. It stores values of string data type and provides a way to identify each customer by their first name.","mappings":[],"tags":[]}},{"name":"Last_Name","type":"string","nullable":true,"metadata":{"description":"Stores the last name of each customer. The values in this column are of string data type and provide a way to identify customers based on their family name. This column is part of the customers_nv dataset schema.","mappings":[],"tags":[]}},{"name":"Gender","type":"string","nullable":true,"metadata":{"description":"Indicates the gender of each customer. It stores values of string data type, either 'Male' or 'Female', providing a way to categorize customers based on their gender.","mappings":[],"tags":[]}},{"name":"Age","type":"string","nullable":true,"metadata":{"description":"Age of the customer in years. It stores numerical values in string data type, indicating the age of each customer. This column provides information about the age distribution of customers in the dataset.","mappings":[],"tags":[]}},{"name":"Income","type":"string","nullable":true,"metadata":{"description":"This column represents the income of each customer. It stores numerical values in string data type, indicating the estimated income of individual customers. This information can be used to segment customers based on their purchasing power and target them with appropriate marketing strategies.","mappings":[],"tags":[]}},{"name":"Phone Number","type":"string","nullable":true,"metadata":{"description":"Stores the phone number of each customer. The values in this column are of string data type and provide a way to contact each customer. It is important to note that this column may contain different formats of phone numbers, such as with or without country codes or dashes.","mappings":[],"tags":[]}},{"name":"Email Address","type":"string","nullable":true,"metadata":{"description":"Stores the email address of each customer. It is a string data type column that contains unique email addresses for each customer. This column can be used to communicate with customers and send promotional emails or newsletters.","mappings":[],"tags":[]}},{"name":"City","type":"string","nullable":true,"metadata":{"description":"The name of the city where the property is located. This column stores values of string data type and provides information about the geographical location of the property.","mappings":[],"tags":[]}},{"name":"State","type":"string","nullable":true,"metadata":{"description":"","mappings":[],"tags":[]}},{"name":"Zip Code","type":"string","nullable":true,"metadata":{"description":"The postal code of the customer's address. It stores a string value that represents the zip code of the customer's location. This column can be used to group customers by their geographical location.","mappings":[],"tags":[]}},{"name":"Credit Rating","type":"string","nullable":true,"metadata":{"description":"Credit rating of each customer. It stores a string value indicating the creditworthiness of each customer. The values in this column can range from poor to excellent, and are used to assess the risk associated with lending money to each customer.","mappings":[],"tags":[]}},{"name":"PropertyType","type":"string","nullable":true,"metadata":{"description":"Specifies the type of property associated with each mortgage. It stores values of string data type, indicating whether the property is a single-family home, multi-family home, condominium, or other type of property. This column provides important information about the characteristics of the properties associated with each mortgage.","mappings":[],"tags":[]}},{"name":"Servicer","type":"string","nullable":true,"metadata":{"description":"The name of the company or organization that services the mortgage loan. This column stores string values and provides information about the entity responsible for managing the loan payments and other related activities.","mappings":[],"tags":[]}},{"name":"ServicerType","type":"string","nullable":true,"metadata":{"description":"Indicates the type of servicer responsible for managing the mortgage loan. The values in this column are of string data type and provide information about the organization or entity responsible for servicing the loan, such as a bank or mortgage company. This column can be used to track the performance of different types of servicers and their impact on loan status and other metrics.","mappings":[],"tags":[]}},{"name":"LoanType","type":"string","nullable":true,"metadata":{"description":"Specifies the type of loan associated with each property. It stores values of string data type, indicating the type of loan taken by the property owner. This column provides information about the terms and conditions of the loan, such as interest rates and payment schedules.","mappings":[],"tags":[]}},{"name":"UnPaidBalance","type":"double","nullable":true,"metadata":{"description":"The outstanding balance on the mortgage loan for a particular property. This column stores numerical values in double data type, indicating the amount of money that the borrower still owes on their mortgage loan. It is an important metric for lenders to assess the risk associated with a particular loan.","mappings":[],"tags":[]}},{"name":"CurrentPropValue","type":"double","nullable":true,"metadata":{"description":"The current market value of the property associated with the mortgage. This column stores numerical values in double data type, indicating the estimated worth of the property at the time of data collection. It provides an insight into the value of the property and its potential for generating revenue.","mappings":[],"tags":[]}},{"name":"LoanStatus","type":"string","nullable":true,"metadata":{"description":"Indicates the current status of the loan associated with the property. The values in this column are of string data type and provide information on whether the loan is in good standing, delinquent, or in default. This column is important for tracking the overall health of the mortgage portfolio.","mappings":[],"tags":[]}},{"name":"UPB_to_Value_Ratio","type":"double","nullable":true,"metadata":{"description":"","mappings":[],"tags":[]}}]},"escape":null,"unescapedQuoteHandling":null,"positiveInf":null,"comment":null,"lineSep":null,"componentInfo":{"gemId":"gitUri=http://gitserver:3000/DxEheDCJ_team_5751/DxEheDCJ_project_12654.git&subPath=&tag=0.2.26&projectSubscriptionProjectId=12654&path=gems/csv","projectName":"ProphecySparkBasicsPython"},"samplingRatio":null,"dateFormat":null,"mode":null,"header":true,"columnNameOfCorruptRecord":null,"modifiedBefore":null,"ignoreTrailingWhiteSpaceWriting":null,"maxCharsPerColumn":null,"negativeInf":null,"createSingleOutputFile":null,"pathGlobFilter":null,"datasetType":"File","useSchema":true,"modifiedAfter":null}